rainbow-mobile/etc_delight_firmware/PIC32MK_L6205_OUTLET_IGNORE_CUR_220914.X/PIC32MK_L6205_OUTLET_IGNORE_CUR_220914.X/PIC32MK_L6205_OUTLET_IGNORE_CUR_220914.X/main.c

#include <../xc.h>

#include <sys/attribs.h>
#include <math.h>

#include "cpu_config.h"
#include "board_definition.h"
#include "init.h"
#include "timer.h"
#include "port.h"
#include "can.h"
#include "adc.h"
#include "qei.h"
#include "spi.h"
#include "status.h"
#include "control.h"
#include "execution.h"
#include "FOC.h"
#include "pwm.h"
#include "home.h"


static unsigned long timerCnt = 0;

static int init_start_pos = 0;

static void SPEED_CONTROL_LOOP();
static void GOTO_CONTROL_LOOP();
static void CheckError_TurnOff();
static void InitControlHandler();
static void InitHomeHandler();

unsigned int rising_time, falling_time;
int falling_edge_rcvd = 0;
int rising_edge = 1;

static int mv_avg_ultra_sonic = 0;
unsigned short ultra_sonic_avg;
unsigned int ultra_sonic_state = 1;
unsigned int ultra_sonic_fail_count = 0;

unsigned char LIMIT_STAT[MAX_CH] = {0,};
unsigned char LIMIT_ADDITIONAL_STAT = 0;
unsigned char ULTRA_SONIC_ERROR = 0;

//for test
int LED_STATE = 10;

int main(){
    // cpu acceleration setting -------------------
    asm volatile("di");
    CHECONbits.PFMWS = 0b011;
    CHECONbits.PREFEN = 0b01;
    register unsigned long tmp;
    asm("mfc0 %0,$16,0" :  "=r"(tmp));
    tmp = (tmp & ~7) | 3;
    asm("mtc0 %0,$16,0" :: "r" (tmp));
    // --------------------------------------------
    
    
    // apply initial delay for stable operation ---
    int initial_delay;
    for(initial_delay=0; initial_delay<100000; initial_delay++)
        ;
    for(initial_delay=0; initial_delay<100000; initial_delay++)
        ;
    volatile int initial_delay2 = 12000000;
    while(initial_delay2--)
        ;
    // --------------------------------------------
    
    // multi-vector enable
    INTCONbits.MVEC = 1;
       
    // Init Status
    STAT[0].B = 0;
    STAT[1].B = 0;
    
    
    // Initialize -----
    InitPort();
    InitBoardIdentification();
    InitPeripheral();
    
    
    //MOTOR_HIP_OFF
    GateDriver_OFF(0);
    GateDriver_OFF(1);

    asm volatile("ei");

    EEPROM_DESELECT
    
    int i, j;
    for(i=0; i<1000; ++i)
        for(j=0; j<800; ++j)
            ;   
            
    InitADC(1);
    InitTimer3();
    
            
    unsigned char canTxData[8] = {0,};
    Push_CAN_TX_Ring(900+JMC, 1, canTxData); 
        
    
    
    // BOBA BOBA
    goto_param[0].move_flag = 0;
    goto_param[0].stop_flag = 0;
    goto_param[1].move_flag = 0;
    goto_param[1].stop_flag = 0;
    
    
    // spin
    goto_param[0].fixed_a = SPIN_ACC;   // 1pulse/tick^2
    ENC_RES[0] = SPIN_ENC_RES;
    // door
    goto_param[1].fixed_a = DOOR_ACC;   // 1pulse/tick^2
    ENC_RES[1] = DOOR_ENC_RES;
    
    
//    LATBbits.LATB3 = 0;
//    LATBbits.LATB9 = 0;

    
    unsigned long while_cnt = 0;
    while(1){
        while_cnt++;
        
        // CAN Handler
        Handler_CAN_TX_Ring();
//        Handler_CAN_TX_Ring_TMR3();
                
        // Error Handler
        Handler_Error(timerCnt);
        
        // Status Handler
        Handler_Status(timerCnt);

        
        int ch;
        for(ch=0; ch<MAX_CH; ch++){
            if(InitControlFlag[ch] == 1){
                InitControlHandler(ch);            
            }else if(InitHomeFlag[ch] != 0){
                InitHomeHandler(ch);
            }
        }
        
        // EEPROM Handler
        if(while_cnt%20 == 0){
            Handler_EEPROM_Ring();
        }
        
        
        Handler_ADC_Trigger(timerCnt);
                
        
        
        if(timerCnt % 200 == 0){
            LATAbits.LATA12 ^= 1;
            
            
        }
        // --------------------------------------------
    }
}


static int InputCaptureCount = 0;
static int glitch_count = 0;

unsigned int t3_cnt = 0;
void __ISR(_TIMER_3_VECTOR, IPL6AUTO) Handler_TMR_3(){
    while(!ADCDSTAT1bits.ARDY0)
        ;
    while(!ADCDSTAT1bits.ARDY1)
        ;
    
    ++t3_cnt;
    UpdateEncoder();

    
    int ch = 0;
    for(ch=0; ch<MAX_CH; ch++){
        switch(CONTROL_MODE[ch]){

        case CONTROL_MODE_FOC_POS_CONTROL:
            if(t3_cnt%40 == 0){
                if(STAT[ch].b.RUN == 1){
                    GO_POS_CNT[ch]++;
                }
                if(GO_POS_CNT[ch] > 2){
                    SPEED_CONTROL_LOOP(ch);
                    GOTO_CONTROL_LOOP(ch);
                    Handler_Control(ch);
                }
            }
            FOC_CurrentControl_Double(ch);        
            break;

        case CONTROL_MODE_FOC_HOME_CONTROL:
            if((InitHomeFlag[ch] == 1) && (InitHomeState[ch] == 2)){
                // wait home sensor undetected
                if(ch == 0){
                    if(HOME_SENSOR1 == 1){
                        speed_test_start[ch] = 2;
                        InitHomeState[ch] = 3;
                    }
                }else{
                    if(HOME_SENSOR2 == 0){
                        speed_test_start[ch] = 2;
                        InitHomeState[ch] = 3;
                    }
                }
            }else if((InitHomeFlag[ch] == 1) && (InitHomeState[ch] == 4)){
                // wait home sensor detected
                if(ch == 0){
                    if(HOME_SENSOR1 == 0){
                        InitHomeOffset[ch] = currentMotorPosition[ch];
                        speed_test_start[ch] = 2;
                        InitHomeState[ch] = 5;
                    }
                }else{
                    if(HOME_SENSOR2 == 1){
                        InitHomeOffset[ch] = currentMotorPosition[ch];
                        speed_test_start[ch] = 2;
                        InitHomeState[ch] = 5;
                    }
                }
            }

            if(t3_cnt%40 == 0){
                SPEED_CONTROL_LOOP(ch);
                GOTO_CONTROL_LOOP(ch);
                Handler_Control(ch);
            }
            FOC_CurrentControl_Double(ch);
            break;

        case CONTROL_MODE_FOC_CUR_CONTROL:
            ref_current_q[ch] = NewInputCurrent[ch];

