rainbow-mobile/etc_delight_firmware/PIC32MK_L6205_OUTLET_IGNORE_CUR_220914.X/PIC32MK_L6205_OUTLET_IGNORE_CUR_220914.X/PIC32MK_L6205_OUTLET_IGNORE_CUR_220914.X/main.c
            FOC_CurrentControl_Double(ch);
            break;

        case CONTROL_MODE_FOC_OPENLOOP_CONTROL:
            FOC_MeasureCurrent(ch);
            FOC_OpenLoopControl(ch);            
            break;

        case CONTROL_MODE_NO_ACT:
        default:
            FOC_MeasureCurrent(ch);
            break;
        }
        
        MV_AVG_Q(ch);

        if(t3_cnt%20 == 0){ // 1kHz
            ReadEncoder(ch);
        }

        // encoder send itself (20k/2000 -> 10Hz)
        if(t3_cnt%2000 == 0){
            CMD_SendEncoder(ch);
        }
    }
    
    
    LIMIT_STAT[0] = HOME_SENSOR1;
    LIMIT_STAT[1] = HOME_SENSOR2;
    LIMIT_ADDITIONAL_STAT = ADDITIONAL_SENSOR;
        
    
    
//#define LED_TEST_MODE
    
#define YELLOW_R    1500
#define YELLOW_G    1500
#define YELLOW_B    0
    
#define GREEN_R    0
#define GREEN_G    1500
#define GREEN_B    0
    
#define RED_R    1500
#define RED_G    0
#define RED_B    0
    
    static unsigned int green_blink_cnt = 0;
    
    if(t3_cnt%20 == 0){ // 1kHz
        timerCnt++;
        
        //for LED TEST
        if(timerCnt%3 == 0){
            switch(LED_STATE){
                case 10: // Go Yellow
                    if(PDC3 > YELLOW_R){
                        PDC3 = PDC3 - 1;
                    }else if(PDC3 < YELLOW_R){
                        PDC3 = PDC3 + 1;
                    }
                    if(PDC4 > YELLOW_G){
                        PDC4 = PDC4 - 1;
                    }else if(PDC4 < YELLOW_G){
                        PDC4 = PDC4 + 1;
                    }
                    if(PDC5 > YELLOW_B){
                        PDC5 = PDC5 - 1;
                    }else if(PDC5 < YELLOW_B){
                        PDC5 = PDC5 + 1;
                    }
#ifdef LED_TEST_MODE
                    if(PDC3 == YELLOW_R && PDC4 == YELLOW_G && PDC5 == YELLOW_B){
                        LED_STATE = 20;
                    }
#endif
                    break;
                    
                
                    
                case 20: // Go Green
                    if(PDC3 > GREEN_R){
                        PDC3 = PDC3 - 1;
                    }else if(PDC3 < GREEN_R){
                        PDC3 = PDC3 + 1;
                    }
                    if(PDC4 > GREEN_G){
                        PDC4 = PDC4 - 1;
                    }else if(PDC4 < GREEN_G){
                        PDC4 = PDC4 + 1;
                    }
                    if(PDC5 > GREEN_B){
                        PDC5 = PDC5 - 1;
                    }else if(PDC5 < GREEN_B){
                        PDC5 = PDC5 + 1;
                    }
#ifdef LED_TEST_MODE
                    if(PDC3 == GREEN_R && PDC4 == GREEN_G && PDC5 == GREEN_B){
                        green_blink_cnt = 0;
                        LED_STATE = 30;
                    }
#endif
                    break;
                    
              
                    
                    
                case 30:
                    // Green Blinking
                    green_blink_cnt++;
                    if(green_blink_cnt%400 == 0){
                        PDC3 = GREEN_R;
                        PDC4 = GREEN_G;
                        PDC5 = GREEN_B;
                    }else if(green_blink_cnt%400 == 200){
                        PDC3 = 0;
                        PDC4 = 0;
                        PDC5 = 0;
                    }
#ifdef LED_TEST_MODE
                    if(green_blink_cnt == 3100){
                        LED_STATE = 10;
                    }
#endif
                    break;
                    
                case 40: // Just Yellow
                    PDC3 = YELLOW_R;
                    PDC4 = YELLOW_G;
                    PDC5 = YELLOW_B;
                    break;
                    
                case 50: // Just Green
                    PDC3 = GREEN_R;
                    PDC4 = GREEN_G;
                    PDC5 = GREEN_B;
                    break;
                    
                case 60: // Just Red
                    PDC3 = RED_R;
                    PDC4 = RED_G;
                    PDC5 = RED_B;
                    break;
                    
                default:
                    PDC3 = PWM_STOP;
                    PDC4 = PWM_STOP;
                    PDC5 = PWM_STOP;
            }
        }
        
        if(timerCnt%1000 == 0){
            LATEbits.LATE15 ^= 1;            
        }
    }
    
    
    // =========================================================================
    if(t3_cnt%2000 == 0){
        ultra_sonic_state = 1;
        ultra_sonic_fail_count++;
        if(ultra_sonic_fail_count > 30){
            ULTRA_SONIC_ERROR = 1;
        }else{
            ULTRA_SONIC_ERROR = 0;
        }
    }
    switch(ultra_sonic_state){
        case 1:
            rising_edge = 1;
            falling_edge_rcvd = 0;
            LATFbits.LATF0 = 1; // UltraSonic Trig high
            ultra_sonic_state = 2;
            break;
        case 2:
            LATFbits.LATF0 = 0; // UltraSonic Trig low
            ultra_sonic_state = 3;
            break;
        case 3:
            if(falling_edge_rcvd == 1){
                falling_edge_rcvd = 0;

                glitch_count = 0;
                ultra_sonic_state = 4;
            }
            break;
        case 4:
        {
            glitch_count++;
            if(glitch_count > 10){ // 0.5ms
                if(InputCaptureCount == 0){
                    // no glitch
                    int temptemp = 0;
                    if (falling_time > rising_time) {
                        temptemp = falling_time - rising_time;
                    }else {
                        temptemp = (PR2 - rising_time) + falling_time;
                    }

                    int ultra_sonic_data = (unsigned short)((float)(temptemp)*0.0184);
                    ultra_sonic_avg = ultra_sonic_data;
                    if(ultra_sonic_avg > 0xFF){
                        ultra_sonic_avg = 0xFF;
                    }
                    ultra_sonic_fail_count = 0;
                }else{
                    // there is glitch --> ignore data
                    ;
                }
                ultra_sonic_state = 0;
            }
            break;
        }
        default:
            break;
    }   
    // =========================================================================
   
    
    
//    CheckError_TurnOff();     // do not turn off when JAM CUR BIG INP error occur
        
    IFS0bits.T3IF=0;
}


