rainbow-mobile/etc_delight_firmware/PIC32MK_L6205_OUTLET_IGNORE_CUR_220914.X/PIC32MK_L6205_OUTLET_IGNORE_CUR_220914.X/PIC32MK_L6205_OUTLET_IGNORE_CUR_220914.X/main.c
void __ISR(_INPUT_CAPTURE_4_VECTOR, IPL5AUTO) Handler_INPUT_CAPTURE(){
    unsigned int t1;
    t1 = IC4BUF;
    
    InputCaptureCount++;
    if (rising_edge == 1) {
        rising_edge = 0;
        rising_time = t1;
    }
    else {
        rising_edge = 1;
        falling_edge_rcvd = 1;
        falling_time = t1;
        InputCaptureCount = 0;
    }
    //Clear IF
    IFS0bits.IC4IF = 0;
}


void InitHomeHandler(){
    int ch;
    for(ch=0; ch<MAX_CH; ch++){
        switch(InitHomeState[ch]){
        case 1:
            // first check the home sensor
            // if sensor on --> move back
            // if sensor off --> move forward
            if(speed_test_start[ch] != 0){
                // do nothing until motor finishes previous work
                break;
            }

            CONTROL_MODE[ch] = CONTROL_MODE_FOC_HOME_CONTROL;

            if(ch == 0){
                if(HOME_SENSOR1 == 0){
                    // move back
                    speed_test_target[ch] = -SPIN_HOME_SPD * ENC_RES[ch] * ENC_MUL / 500 / 60;   // -1000 RPM

                    if(speed_test_target[ch] > -1)
                        speed_test_target[ch] = -1;
                    speed_test_acc[ch] = fabs(speed_test_target[ch] / 500);//1000;


                    if(HOME_DIR[ch] == 0){
                        ;
                    }else{
                        speed_test_target[ch] = -speed_test_target[ch];
                    }

                    if (speed_test_acc[ch] < 1)
                        speed_test_acc[ch] = 1;
                    if(speed_test_start[ch] == 0){
                        speed_test_cur_speed[ch] = 0;
                    }
                    InitHomeState[ch] = 2;
                    speed_test_start[ch] = 1;

                }else{
                    // move forward
                    // go to case 3
                    InitHomeState[ch] = 3;
                }
            }else{
                if(HOME_SENSOR2 == 1){
                    // move back
                    speed_test_target[ch] = -DOOR_HOME_SPD * ENC_RES[ch] * ENC_MUL / 500 / 60;   // -1000 RPM

                    if(speed_test_target[ch] > -1)
                        speed_test_target[ch] = -1;
                    speed_test_acc[ch] = fabs(speed_test_target[ch] / 500);//1000;


                    if(HOME_DIR[ch] == 0){
                        ;
                    }else{
                        speed_test_target[ch] = -speed_test_target[ch];
                    }

                    if (speed_test_acc[ch] < 1)
                        speed_test_acc[ch] = 1;
                    if(speed_test_start[ch] == 0){
                        speed_test_cur_speed[ch] = 0;
                    }
                    InitHomeState[ch] = 2;
                    speed_test_start[ch] = 1;

                }else{
                    // move forward
                    // go to case 3
                    InitHomeState[ch] = 3;
                }
            }


            break;
        case 2:
            // wait until home sensor undetected
            // checked in the Timer3 and change state at there
            break;

        case 3:
            // move forward
            if(speed_test_start[ch] != 0){
                // do nothing until motor finishes previous work
                break;
            }

            if(ch == 0){
                speed_test_target[ch] = SPIN_HOME_SPD * ENC_RES[ch] * ENC_MUL / 500 / 60;   // -1000 RPM
            }else{
                speed_test_target[ch] = DOOR_HOME_SPD * ENC_RES[ch] * ENC_MUL / 500 / 60;   // -1000 RPM
            }
            if(speed_test_target[ch] < 1)
                speed_test_target[ch] = 1;
            speed_test_acc[ch] = fabs(speed_test_target[ch] / 500);//1000;

            if(HOME_DIR[ch] == 0){
                ;
            }else{
                speed_test_target[ch] = -speed_test_target[ch];
            }

            if (speed_test_acc[ch] < 1)
                speed_test_acc[ch] = 1;
            if(speed_test_start[ch] == 0){
                speed_test_cur_speed[ch] = 0;
            }
            InitHomeState[ch] = 4;
            speed_test_start[ch] = 1;
            break;

        case 4:
            // wait until home sensor detected
            // checked in the Timer3 and change state at there
            break;

        case 5:
            // move back for space
            if(speed_test_start[ch] != 0){
                // do nothing until motor finishes previous work
                break;
            }

            set_goto_start_pos(ch, currentMotorPosition[ch]);
            goto_param[ch].cur_pos = currentMotorPosition[ch];
            if(HOME_DIR[ch] == 0){
                if(ch == 0){
                    //set_goto_target(currentMotorPosition-HOME_ZERO_OFFSET*ENC_MUL, 5*ENC_MUL);     // 200 pulse/tick * 500 tick/sec = 100,000pulse/sec => 60*100,000/16384 = 366rpm
                    set_goto_target(ch, InitHomeOffset[ch]-HOME_ZERO_OFFSET[ch]*ENC_MUL, SPIN_HOME_VEL*ENC_MUL);     // 200 pulse/tick * 500 tick/sec = 100,000pulse/sec => 60*100,000/16384 = 366rpm
                }else{
                    set_goto_target(ch, InitHomeOffset[ch]-HOME_ZERO_OFFSET[ch]*ENC_MUL, DOOR_HOME_VEL*ENC_MUL);     // 200 pulse/tick * 500 tick/sec = 100,000pulse/sec => 60*100,000/16384 = 366rpm
                }
            }else{
                if(ch == 0){
                    set_goto_target(ch, InitHomeOffset[ch]+HOME_ZERO_OFFSET[ch]*ENC_MUL, SPIN_HOME_VEL*ENC_MUL);
                }else{
                    set_goto_target(ch, InitHomeOffset[ch]+HOME_ZERO_OFFSET[ch]*ENC_MUL, DOOR_HOME_VEL*ENC_MUL);
                }
            }
            InitHomeState[ch] = 6;
            break;

        case 6:
            if(goto_param[ch].move_flag == 0){
                InitHomeState[ch] = 0;
                InitHomeFlag[ch] = 0;

                currentMotorPosition[ch] = NewInputRef[ch] = REF[ch] = PREV_REF[ch] = NewPos[ch] = OldPos[ch] = 0;
                goto_param[ch].cur_pos = goto_param[ch].start_pos = currentMotorPosition[ch];

                STAT[ch].b.INIT = 1;
                CONTROL_MODE[ch] = CONTROL_MODE_FOC_POS_CONTROL;
            }
            break;
        }
    }
}



void SPEED_CONTROL_LOOP(){
    static int over_current_count[MAX_CH] = {0,};

    int ch;
    for(ch=0; ch<MAX_CH; ch++){    
        if(speed_test_start[ch] == 1){
            STAT[ch].b.OP_STATUS = 1;
            //speed_test_cur_speed += speed_test_acc;
            if(speed_test_cur_speed[ch] < speed_test_target[ch]){// >= 0){
                speed_test_cur_speed[ch] += speed_test_acc[ch];
                if(speed_test_cur_speed[ch] > speed_test_target[ch]){
                    speed_test_cur_speed[ch] = speed_test_target[ch];
                }
            }else if(speed_test_cur_speed[ch] > speed_test_target[ch]){
                speed_test_cur_speed[ch] -= speed_test_acc[ch];
                if(speed_test_cur_speed[ch] < speed_test_target[ch]){
                    speed_test_cur_speed[ch] = speed_test_target[ch];
                }
            }
            int prev_ref = REF[ch];
            int itemp = prev_ref + speed_test_cur_speed[ch];
            NewInputRef[ch] = itemp;
        }else if(speed_test_start[ch] == 2){
            STAT[ch].b.OP_STATUS = 1;
            if(speed_test_cur_speed[ch] >= 0){
                speed_test_cur_speed[ch] -= speed_test_acc[ch];
                if(speed_test_cur_speed[ch] <= 0){
                    speed_test_cur_speed[ch] = 0;
                    speed_test_start[ch] = 0;
                }
            }else{
                speed_test_cur_speed[ch] += speed_test_acc[ch];
                if(speed_test_cur_speed[ch] >= 0){
                    speed_test_cur_speed[ch] = 0;
                    speed_test_start[ch] = 0;
                }
            }
            int prev_ref;
            prev_ref = REF[ch];
            int itemp = prev_ref + speed_test_cur_speed[ch];
            NewInputRef[ch] = itemp;
        }


        if(speed_test_start[ch] != 0){
            // check current 
            if(ch == 1){
                if(abs(measured_current_q[ch]) > COLLISION_CURRENT){
                    over_current_count[ch]++;
                    if(over_current_count[ch] > COLLISION_COUNT){   // 0.3 sec
                        float new_target;
                        if(speed_test_cur_speed[ch] >= 0){
                            new_target = currentMotorPosition[ch] - COLLISION_BACK_PULSE*ENC_MUL;
                        }else{
                            new_target = currentMotorPosition[ch] + COLLISION_BACK_PULSE*ENC_MUL;
                        }
                        goto_param[ch].move_flag = 0;
                        set_goto_start_pos(ch, (float)(currentMotorPosition[ch]));
                        goto_param[ch].cur_pos = currentMotorPosition[ch];
                        NewInputRef[ch] = goto_param[ch].cur_pos;
                        set_goto_target(ch, new_target, COLLISION_BACK_SPD*ENC_MUL);

                        speed_test_start[ch] = 0;   // finish speed mode
                        if(InitHomeFlag[ch] == 1){  // finish home search
                            InitHomeFlag[ch] = 0;
                            InitHomeState[ch] = 0;
                            STAT[ch].b.INIT = 0;
                            STAT[ch].b.COLLISION_ERR = 1;
                        }
                    }
                }else{
                    over_current_count[ch] = 0;
                }
            }
        }
    }
}

void GOTO_CONTROL_LOOP(){
    static int over_current_count[MAX_CH] = {0,};
    static int do_brake[MAX_CH] = {0,};
    static float brake_spd[MAX_CH] = {0,};
    static int do_move_back[MAX_CH] = {0,};
    
    int ch = 0;
    for(ch=0; ch<MAX_CH; ch++){
        if(speed_test_start[ch] == 0){
            if(goto_param[ch].stop_flag == 1){
                goto_param[ch].stop_flag = 0;
                do_brake[ch] = 1;
                brake_spd[ch] = goto_param[ch].cur_vel;
                goto_param[ch].move_flag = 0;
            }
            if(do_brake[ch] == 1){
                STAT[ch].b.OP_STATUS = 1;
                float new_spd = 0.0;
                if(brake_spd[ch] > 0){
                    new_spd = brake_spd[ch]-goto_param[ch].fixed_a*2.0;
                    if(new_spd < 0.0){
                        new_spd = 0.0;
                        do_brake[ch] = 0;
                        STAT[ch].b.OP_STATUS = 0;
                    }
                }else{
                    new_spd = brake_spd[ch]+goto_param[ch].fixed_a*2.0;
                    if(new_spd > 0.0){
                        new_spd = 0.0;
                        do_brake[ch] = 0;
                        STAT[ch].b.OP_STATUS = 0;
                    }
                }
                brake_spd[ch] = new_spd;
                goto_param[ch].cur_pos = goto_param[ch].cur_pos + new_spd;

                NewInputRef[ch] = goto_param[ch].cur_pos;

            }else if(do_move_back[ch] == 1){
                STAT[ch].b.OP_STATUS = 1;
                do_move_back[ch] = 0;
                set_goto_start_pos(ch, (float)(currentMotorPosition[ch]));
                goto_param[ch].cur_pos = currentMotorPosition[ch];
                set_goto_target(ch, OpenPositionPulse[ch]*ENC_MUL, COLLISION_BACK_SPD*ENC_MUL);

            }else if(goto_param[ch].move_flag == 1){
                STAT[ch].b.OP_STATUS = 1;
                move_goto_target(ch);
                NewInputRef[ch] = goto_param[ch].cur_pos;

