rainbow-mobile/etc_delight_firmware/PIC32MK_L6205_OUTLET_IGNORE_CUR_220914.X/PIC32MK_L6205_OUTLET_IGNORE_CUR_220914.X/PIC32MK_L6205_OUTLET_IGNORE_CUR_220914.X/main.c
                if(ch == 1){
                    // collision 
                    if(STAT[ch].b.COLLISION_ERR == 0){

                        // check error flag (JAM BIG CUR INP)
                        if((STAT[ch].B & 0x00000F00) != 0){
                            STAT[ch].b.COLLISION_ERR = 1;
                            do_move_back[ch] = 1;
                            goto_param[ch].move_flag = 0;
                        }

                        // check mismatch pulse
                        if(goto_param[ch].move_flag == 0){
                            int prev_target = (int)(goto_param[ch].target_pos);
                            if(abs(prev_target - currentMotorPosition[ch]) > COLLISION_MISMATCH_PULSE*ENC_MUL){
                                STAT[ch].b.COLLISION_ERR = 1;
                                do_move_back[ch] = 1;
                                goto_param[ch].move_flag = 0;
                            }
                        }


                        // check current 
                        if(abs(measured_current_q[ch]) > COLLISION_CURRENT){
                            over_current_count[ch]++;
                            if(over_current_count[ch] > COLLISION_COUNT){   // 0.3 sec
                                STAT[ch].b.COLLISION_ERR = 1;
                                do_move_back[ch] = 1;
                                goto_param[ch].move_flag = 0;
                                over_current_count[ch] = 0;
                            }
                        }else{
                            over_current_count[ch] = 0;
                        }
                    }
                }
            }else if(override_flag[ch] == 1){
                override_flag[ch] = 0;
                set_goto_start_pos(ch, (float)(currentMotorPosition[ch]));
                goto_param[ch].cur_pos = currentMotorPosition[ch];
                set_goto_target(ch, override_target[ch]*ENC_MUL, override_speed[ch]*ENC_MUL);
            }else{
                STAT[ch].b.OP_STATUS = 0;
            }
        }else{
            goto_param[ch].cur_pos = NewInputRef[ch];
        }
    }
}

void CheckError_TurnOff(){
    int ch = 0;
    for(ch=0; ch<MAX_CH; ch++){
        if(((STAT[ch].B & 0x00000F00) != 0)){// || (STAT.b.CUR_BIG == 1)){// || (STAT.b.CAN_ERR == 1)){
            if(ERROR_FLAG[ch] == 0){
                ERROR_FLAG[ch] = 1;
                GateDriver_OFF(ch);
                CONTROL_MODE[ch] = CONTROL_MODE_NO_ACT;
            }
        }
    }
}

void InitControlHandler(){
    int ch = 0;
    for(ch=0; ch<MAX_CH; ch++){
        switch(InitControlState[ch]){
        case 1:
            STAT[ch].b.COLLISION_ERR = 0;
            STAT[ch].b.BIG = 0;
            STAT[ch].b.JAM = 0;
            STAT[ch].b.CUR = 0;
            STAT[ch].b.INP = 0;
            STAT[ch].b.INIT = 0;
            GateDriver_OFF(ch);
            CONTROL_MODE[ch] = CONTROL_MODE_NO_ACT;

            InitControlState[ch] = 2;
            break;

        case 2: 
            CMD_FetEnable(ch, 1);
            CMD_RunClosedLoop(ch, 1, 0);

            InitControlState[ch] = 3;
            break;

        case 3:
            InitHomeState[ch] = 1;
            InitHomeFlag[ch] = 1;

            InitControlState[ch] = 0;
            InitControlFlag[ch] = 0;
            break;   
        }
    }
}
